In [1]:
import pandas as pd
from tqdm import tqdm

pd.set_option('display.max_columns', None)

In [2]:
def verify(df):
    print(df.shape)
    display(df.head())
    display(df.tail())

# Train

In [3]:
df = pd.read_csv('data/train.csv')
verify(df)

(3000888, 6)

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

,id,date,store_nbr,family,sales,onpromotion
3000883,3000883,2017-08-15,9,POULTRY,438.133,0
3000884,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
3000885,3000885,2017-08-15,9,PRODUCE,2419.729,148
3000886,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
3000887,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [4]:
df.dtypes

id               int64
date            object
store_nbr        int64
family          object
sales          float64
onpromotion      int64
dtype: object

In [5]:
df['date'] = pd.to_datetime(df['date'])

In [6]:
print(df.nunique())
print(df.isna().sum())
print(df.drop_duplicates().shape)

id             3000888
date              1684
store_nbr           54
family              33
sales           379610
onpromotion        362
dtype: int64
id             0
date           0
store_nbr      0
family         0
sales          0
onpromotion    0
dtype: int64
(3000888, 6)

In [7]:
print(df.date.min(), df.date.max())
print(df.date.max() - df.date.min())

2013-01-01 00:00:00 2017-08-15 00:00:00
1687 days 00:00:00

In [11]:
df_fill = pd.DataFrame()

for store in tqdm(df.store_nbr.unique()):
    for f in df.family.unique():
        df_family_store = df[(df['store_nbr'] == store) & (df['family'] == f)]
        df_family_store.set_index('date', inplace=True)
        df_family_store = df_family_store.resample('1D').ffill().reset_index()
        df_fill = pd.concat([df_fill, df_family_store])

df_fill.drop(columns=['id'], inplace=True)
df_fill = df_fill.reset_index(drop=True).reset_index()
verify(df_fill)

In [12]:
df_fill.to_csv('data/train_clean.csv', index=False)

# Test

In [13]:
df = pd.read_csv('data/test.csv')
verify(df)

(28512, 5)

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

            id        date  store_nbr                      family  onpromotion
28507  3029395  2017-08-31          9                     POULTRY            1
28508  3029396  2017-08-31          9              PREPARED FOODS            0
28509  3029397  2017-08-31          9                     PRODUCE            1
28510  3029398  2017-08-31          9  SCHOOL AND OFFICE SUPPLIES            9
28511  3029399  2017-08-31          9                     SEAFOOD            0

In [14]:
df.dtypes

id              int64
date           object
store_nbr       int64
family         object
onpromotion     int64
dtype: object

In [15]:
df['date'] = pd.to_datetime(df['date'])

In [16]:
print(df.nunique())
print(df.isna().sum())
print(df.drop_duplicates().shape)

id             28512
date              16
store_nbr         54
family            33
onpromotion      212
dtype: int64
id             0
date           0
store_nbr      0
family         0
onpromotion    0
dtype: int64
(28512, 5)

In [17]:
print(df.date.min(), df.date.max())
print(df.date.max() - df.date.min())

2017-08-16 00:00:00 2017-08-31 00:00:00
15 days 00:00:00

# Sample Submission

In [18]:
df = pd.read_csv('data/sample_submission.csv')
verify(df)

(28512, 2)

        id  sales
0  3000888    0.0
1  3000889    0.0
2  3000890    0.0
3  3000891    0.0
4  3000892    0.0

            id  sales
28507  3029395    0.0
28508  3029396    0.0
28509  3029397    0.0
28510  3029398    0.0
28511  3029399    0.0

# Oil

In [19]:
df = pd.read_csv('data/oil.csv')
verify(df)

(1218, 2)

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

            date  dcoilwtico
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

In [20]:
df.dtypes

date           object
dcoilwtico    float64
dtype: object

In [21]:
df['date'] = pd.to_datetime(df['date'])

In [22]:
print(df.nunique())
print(df.isna().sum())
print(df.drop_duplicates().shape)

date          1218
dcoilwtico     998
dtype: int64
date           0
dcoilwtico    43
dtype: int64
(1218, 2)

In [23]:
df = df.fillna(method='ffill')
df.isna().sum()

date          0
dcoilwtico    1
dtype: int64

In [24]:
df = df.set_index('date')
df = df.resample('1D').ffill()
df = df.reset_index()
verify(df)

(1704, 2)

        date  dcoilwtico
0 2013-01-01         NaN
1 2013-01-02       93.14
2 2013-01-03       92.97
3 2013-01-04       93.12
4 2013-01-05       93.12

           date  dcoilwtico
1699 2017-08-27       47.65
1700 2017-08-28       46.40
1701 2017-08-29       46.46
1702 2017-08-30       45.96
1703 2017-08-31       47.26

In [25]:
df.isna().sum()

date          0
dcoilwtico    1
dtype: int64

In [26]:
df = df.fillna(method='bfill')
df.isna().sum()

date          0
dcoilwtico    0
dtype: int64

In [27]:
df.to_csv('data/oil_clean.csv', index=False)

# Holidays Events

In [37]:
df = pd.read_csv('data/holidays_events.csv')
verify(df)

(350, 6)

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

           date        type    locale locale_name description  transferred
345  2017-12-22  Additional  National     Ecuador   Navidad-3        False
346  2017-12-23  Additional  National     Ecuador   Navidad-2        False
347  2017-12-24  Additional  National     Ecuador   Navidad-1        False
348  2017-12-25     Holiday  National     Ecuador     Navidad        False
349  2017-12-26  Additional  National     Ecuador   Navidad+1        False

In [38]:
df.dtypes

date           object
type           object
locale         object
locale_name    object
description    object
transferred      bool
dtype: object

In [39]:
df['date'] = pd.to_datetime(df['date'])

In [40]:
print(df.nunique())
print(df.isna().sum())
print(df.drop_duplicates().shape)

date           312
type             6
locale           3
locale_name     24
description    103
transferred      2
dtype: int64
date           0
type           0
locale         0
locale_name    0
description    0
transferred    0
dtype: int64
(350, 6)

# Stores

In [45]:
df = pd.read_csv('data/stores.csv')
verify(df)

(54, 5)

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

    store_nbr       city       state type  cluster
49         50     Ambato  Tungurahua    A       14
50         51  Guayaquil      Guayas    A       17
51         52      Manta      Manabi    A       11
52         53      Manta      Manabi    D       13
53         54  El Carmen      Manabi    C        3

In [46]:
df.dtypes

store_nbr     int64
city         object
state        object
type         object
cluster       int64
dtype: object

In [47]:
print(df.nunique())
print(df.isna().sum())
print(df.drop_duplicates().shape)

store_nbr    54
city         22
state        16
type          5
cluster      17
dtype: int64
store_nbr    0
city         0
state        0
type         0
cluster      0
dtype: int64
(54, 5)

# Transactions

In [89]:
df = pd.read_csv('data/transactions.csv')
verify(df)

(83488, 3)

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

             date  store_nbr  transactions
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

In [90]:
df.groupby('store_nbr').date.agg(['min', 'max'])

                  min         max
store_nbr
1          2013-01-02  2017-08-15
2          2013-01-02  2017-08-15
3          2013-01-02  2017-08-15
4          2013-01-02  2017-08-15
5          2013-01-02  2017-08-15
6          2013-01-02  2017-08-15
7          2013-01-02  2017-08-15
8          2013-01-02  2017-08-15
9          2013-01-02  2017-08-15
10         2013-01-02  2017-08-15
11         2013-01-02  2017-08-15
12         2013-01-02  2017-08-15
13         2013-01-02  2017-08-15
14         2013-01-02  2017-08-15
15         2013-01-02  2017-08-15
16         2013-01-02  2017-08-15
17         2013-01-02  2017-08-15
18         2013-01-02  2017-08-15
19         2013-01-02  2017-08-15
20         2015-02-13  2017-08-15
21         2015-07-24  2017-08-15
22         2015-10-09  2017-08-15
23         2013-01-02  2017-08-15
24         2013-01-02  2017-08-15
25         2013-01-01  2017-08-15
26         2013-01-02  2017-08-15
27         2013-01-02  2017-08-15
28         2013-01-02  2017-08-15
29         2015-03-20  2017-08-15
30         2013-01-02  2017-08-15
31         2013-01-02  2017-08-15
32         2013-01-02  2017-08-15
33         2013-01-02  2017-08-15
34         2013-01-02  2017-08-15
35         2013-01-02  2017-08-15
36         2013-05-09  2017-08-15
37         2013-01-02  2017-08-15
38         2013-01-02  2017-08-15
39         2013-01-02  2017-08-15
40         2013-01-02  2017-08-15
41         2013-01-02  2017-08-15
42         2015-08-21  2017-08-15
43         2013-01-02  2017-08-15
44         2013-01-02  2017-08-15
45         2013-01-02  2017-08-15
46         2013-01-02  2017-08-15
47         2013-01-02  2017-08-15
48         2013-01-02  2017-08-15
49         2013-01-02  2017-08-15
50         2013-01-02  2017-08-15
51         2013-01-02  2017-08-15
52         2017-04-20  2017-08-15
53         2014-05-29  2017-08-15
54         2013-01-02  2017-08-15

In [91]:
df.dtypes

date            object
store_nbr        int64
transactions     int64
dtype: object

In [92]:
df['date'] = pd.to_datetime(df['date'])

In [93]:
print(df.nunique())
print(df.isna().sum())
print(df.drop_duplicates().shape)

date            1682
store_nbr         54
transactions    4993
dtype: int64
date            0
store_nbr       0
transactions    0
dtype: int64
(83488, 3)

In [94]:
print(df.date.min(), df.date.max())
print(df.date.max() - df.date.min())

2013-01-01 00:00:00 2017-08-15 00:00:00
1687 days 00:00:00

In [95]:
print("Número de linhas onde cada linha é uma data/store com datas faltantes:", 1682 * 54)
print("Número de linhas onde cada linha é uma data/store sem datas faltantes:", 1688 * 54)

Número de linhas onde cada linha é uma data/store com datas faltantes: 90828
Número de linhas onde cada linha é uma data/store sem datas faltantes: 91152

In [96]:
df_dates = df[['date']].drop_duplicates()
df_dates = df_dates.set_index('date')
df_dates = df_dates.resample('1D').ffill()
df_dates = df_dates.reset_index()
df_dates

           date
0    2013-01-01
1    2013-01-02
2    2013-01-03
3    2013-01-04
4    2013-01-05
...         ...
1683 2017-08-11
1684 2017-08-12
1685 2017-08-13
1686 2017-08-14
1687 2017-08-15

[1688 rows x 1 columns]

In [97]:
df_fill = pd.DataFrame()

for store in tqdm(df.store_nbr.unique()):
    df_store = df[df['store_nbr'] == store]
    df_store = df_dates.merge(df_store, on='date', how='left')
    df_store['store_nbr'] = df_store['store_nbr'].fillna(store)
    df_store['transactions'] = df_store['transactions'].fillna(0)
    df_fill = pd.concat([df_fill, df_store])
    
df_fill = df_fill.reset_index(drop=True)
verify(df_fill)

100%|██████████| 54/54 [00:00<00:00, 207.90it/s]

(91152, 3)

        date  store_nbr  transactions
0 2013-01-01       25.0         770.0
1 2013-01-02       25.0        1038.0
2 2013-01-03       25.0         887.0
3 2013-01-04       25.0        1054.0
4 2013-01-05       25.0        1355.0

            date  store_nbr  transactions
91147 2017-08-11       52.0        2957.0
91148 2017-08-12       52.0        2804.0
91149 2017-08-13       52.0        2433.0
91150 2017-08-14       52.0        2074.0
91151 2017-08-15       52.0        2255.0

In [98]:
df_fill.isna().sum()

date            0
store_nbr       0
transactions    0
dtype: int64

In [99]:
df_fill.to_csv('data/transactions_clean.csv', index=False)